{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"multirow_BTKPj9":{"type":"multirow","blocks":{"row_r6dg7K":{"type":"row","settings":{"image":"shopify:\/\/shop_images\/1.png","caption":"THE studio x","heading":"<strong>Luxury K-tip Extensions<\/strong>","text":"<p>Transform your hair with our premium keratin bonded (K-Tip) extensions seamless, undetectable solution for length, volume, and versatility.<\/p><p><strong>What Are Keratin Bonded (K-Tip) Extensions?<\/strong><\/p><p>Made from 100% human hair, these extensions are fused to your natural hair using a keratin protein bond. When heated, the keratin melts, creating a secure, natural-looking attachment. The bonds are placed in rows for a flawless blend even in ponytails!<\/p><p><strong>Why Choose K-Tip Extensions?<\/strong><\/p><ul><li>Natural & Undetectable: bonds mimic your hair’s texture and movement.<\/li><li>Customizable:Match your color or experiment with new shades without chemicals.<\/li><li>Durable & Long-Lasting: Lasts 3-4 months with proper care.<\/li><li>Styling Freedom: Curl, straighten, or style just like natural hair.<\/li><li>Low Maintenance; Unlike tape-ins or sew-ins, these don’t require maintenance every 4-5 weeks.<\/li><li>Waterproof & Sweat proof: Ideal for active lifestyles! You can work out, sweat, swim in pools, and even enjoy the ocean. We provide specific care instructions to maintain the integrity of your extensions while engaging in these activities. <\/li><\/ul><p><strong>Volume & Length Options:<\/strong><\/p><p>Volume Only: 100 grams or less.<\/p><p>Volume + Length: 150-200 grams.<\/p><p><strong>Our Hair: We use two different kinds of 100% human hair: <\/strong>Premium Quality: Bellami Certified & Virgin Hair<\/p><p><strong>Bellami Hair Pro:<\/strong><\/p><p>Bellami Keratin Tip (K-Tip) extensions are installed using a heating element which safely melts the Keratin Tips onto your own hair. This Keratin Tip is partially made of the same naturally occurring protein found in your hair.<\/p><p>A silicone additive on the K-tip helps to create a protective coating for your natural hair strands. The K-tips are bonded close to the roots of the hair, we ensure there is enough space to allow free movement of your hair which maintains a natural layered texture and feel to your hair.<\/p><ul><li>Hair type:<strong> Cuticle Remy Hair<\/strong><\/li><li>Application:<strong> 4-5 hours<\/strong><\/li><\/ul><p><br\/><strong>Virgin Human Hair Unprocessed, chemical-free hair allows for optimal styling, especially for curly or coily textures.<\/strong><\/p><p><br\/><strong>Can you reuse the hair ?<\/strong><\/p><p>You can but we choose not to because Keratin bond extensions naturally shed over their use. Unlike tapes or beads, they lack a structured base, leading to thinning. While we generally recommend new hair for each installation, exceptions may apply. Reusing hair requires a separate prep\/reinstallation fee.<\/p><p><br\/><\/p><p><strong>Removal Process<\/strong><\/p><p>Cost: $120 per hour<\/p><p>It takes an hour for a smooth removal.  If knots are present (detangled carefully to protect your hair).<\/p><p><br\/><\/p><p><strong>Aftercare Essentials<\/strong><\/p><p>Proper aftercare extends the lifespan of your extensions. We provide a bristle brush, along with expert guidance on recommended products.<\/p><p><br\/><\/p><p>    - Board Brush Gentle on bonds and tangles.<\/p><ul><li>Product Recommendations: We provide a full list of bond-safe shampoos, conditioners, and heat protectants. Some of these products are available for purchase at our salon.<\/li><\/ul><p> - Expert Guidance: Detailed instructions on washing, drying, styling, and how to care for your extensions when swimming or working out.<\/p><p><br\/><strong>Commitment to Excellence<\/strong><\/p><p>We combine Bellami-certified quality, virgin hair, and professional application to deliver undetectable, damage-free transformations. <\/p><p>Whether you want length, volume, or a bold color change, our extensions give you a natural, confident look.<\/p><p><br\/><br\/><\/p>","button_label":"Book Appointment","button_link":"shopify:\/\/collections\/all"}}},"block_order":["row_r6dg7K"],"settings":{"image_height":"adapt","desktop_image_width":"medium","heading_size":"h1","text_style":"body","button_style":"secondary","desktop_content_position":"middle","desktop_content_alignment":"left","image_layout":"alternate-left","section_color_scheme":"","row_color_scheme":"","mobile_content_alignment":"left","padding_top":36,"padding_bottom":36}},"multicolumn_Y6LK99":{"type":"multicolumn","blocks":{"column_XrnApM":{"type":"column","settings":{"title":"<strong>Volume<\/strong>","text":"<p>Suitable for those looking to enhance density without altering their existing length. Volume usually includes 80-100 grams of hair. Volume k-tip extensions can vary in price from $1000-$1400<\/p>","link_label":"","link":""}},"column_ULUNQb":{"type":"column","settings":{"title":"<strong>Volume & Length<\/strong>","text":"<p>Great choice for risk-takers with short hair seeking a dramatic transformation for a luxurious, flowing style. Price: $1700-$2500<\/p>","link_label":"","link":""}},"column_QCKWVC":{"type":"column","settings":{"title":"<strong>Ktips & Combline Combination<\/strong>","text":"<p>Enhance your confidence with Combline, a solution for thin crown or side hair. Pricing ranges from $300-$450 when combined with Ktips.<\/p>","link_label":"","link":""}}},"block_order":["column_XrnApM","column_ULUNQb","column_QCKWVC"],"settings":{"title":"Get a custom quote with a virtual consultation! Submit your hair photos today!","heading_size":"h2","image_width":"full","image_ratio":"adapt","columns_desktop":3,"column_alignment":"left","background_style":"primary","button_label":"Book a Virtual Consult!","button_link":"","color_scheme":"scheme-1","columns_mobile":"1","swipe_on_mobile":false,"padding_top":36,"padding_bottom":36}}},"order":["main","multirow_BTKPj9","multicolumn_Y6LK99"]}